<a href="https://colab.research.google.com/github/19PA1A0251/AI-lab/blob/master/pandas_lab_exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

2) Pandas

i) Create a data Frame manually 

ii)Import a data frame

iii)  Adding, Deleting, Modifying the rows/columns in a dataframe.

iv) Apply functions on dataframe.

V) Iterations on dataframe

vi) Accessing the elements from a dataframe

Vii) Different ways to deal with NAâ€™s in dataframe

viii) Groupby operations on dataframe

ix) Merging dataframes

#### Import the needed packages

In [1]:
import pandas as pd
import numpy as np

## 1) Create a dataframe manually

In [9]:
df=pd.DataFrame({"Roll No":["CSE501","CSE502","CSE503"],"Name":["A.RAMU","B.RAJESH","B.SUBBU"]})
df

  Roll No      Name
0  CSE501    A.RAMU
1  CSE502  B.RAJESH
2  CSE503   B.SUBBU

## 2) Import data into a dataframe

In [10]:
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [ ]:
# Its always a good practicet to check for NA's first.
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [11]:
# Let's try to understand the data using describe function
df.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

In [12]:
# Its also good to check the number of rows and number of columns in a dataset
df.shape

(117, 9)

## 3) Adding, Deleting, Modifying the rows/columns in a dataframe.

### 3.1) Adding a column
Add an extra column "hostler/day's scholar" 
( Get the data from the csv file provided by me)

In [13]:
host_day=pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [14]:
host_day.shape

(117, 1)

In [15]:
df["hostler/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostler/days scholar
0        1      M  ...       Not placed                     d
1        2      F  ...           Placed                     d
2        3      F  ...       Not placed                     d
3        4      M  ...       Not placed                     d
4        5      M  ...       Not placed                     h

[5 rows x 10 columns]

### 3.2) Deleting a column
"registered_for_ Placement_Training" is no more needed. Can you delete it?

In [16]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     d
2        3      F       A  ...        13        Not placed                     d
3        4      M       A  ...        17        Not placed                     d
4        5      M       A  ...        17        Not placed                     h

[5 rows x 9 columns]

### 3.3) Adding a row
A new student got transferred  from SVECW to VIT. Can you add her information?
Her details

'Roll No': 118

'Gender': F

'Section': C

SSC Percentage' 98.4

'inter_Diploma_percentage':99

'B.Tech_percentage':75

'Backlogs': 0

'registered_for_ Placement_Training': Not applicable

'hostler/day's scholar': hostler

'placement status': Not placed

In [17]:
# let's create a dataframe with her details
df1=pd.DataFrame({'Roll No': [118],'Gender': ["F"],'Section': ["C"], "SSC Percentage": [98.4],'inter_Diploma_percentage':[99],'B.Tech_percentage':[75],'Backlogs': [0], 'placement status': ["Not placed"],"hostler/days scholar":["h"]},index=[117])
df1

     Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
117      118      F       C  ...         0        Not placed                     h

[1 rows x 9 columns]

In [18]:
df=df.append(df1)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     d
2        3      F       A  ...        13        Not placed                     d
3        4      M       A  ...        17        Not placed                     d
4        5      M       A  ...        17        Not placed                     h

[5 rows x 9 columns]

### 3.4) Deleting a row
Roll number 4 got transferred to another college. Now his information is no more needed. Now delete roll number 4 information.

In [19]:
df=df.drop(3)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     d
2        3      F       A  ...        13        Not placed                     d
4        5      M       A  ...        17        Not placed                     h
5        6      M       A  ...         6        Not placed                     h

[5 rows x 9 columns]

### 3.5) Modifying elements
Roll number 2 has shifted to the hostel . Can you change her details?

In [20]:
df.loc[1,'hostler/days scholar']="h"
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     h
2        3      F       A  ...        13        Not placed                     d
4        5      M       A  ...        17        Not placed                     h
5        6      M       A  ...         6        Not placed                     h

[5 rows x 9 columns]

## 4) Applying functions on a dataframe.
Say, the university has decided to give grace percentage of 0.05 to people who have less than 70% in B.tech. Can you do the same using apply function?

In [21]:
def incre(x):
    if(x<70):
        return(x+0.05)
    else:
        return(x)

In [22]:
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(incre)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     h
2        3      F       A  ...        13        Not placed                     d
4        5      M       A  ...        17        Not placed                     h
5        6      M       A  ...         6        Not placed                     h

[5 rows x 9 columns]

## 5) Iterations on dataframe
Display the roll number and B.tech percentage of students who got more than 80% in B.tech using iterations. ( No need to create a dataframe)

In [23]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
    print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38

## 6) Accessing the elements from a dataframe
Can you display the SSC and Intermediate percentage of Roll number 2 and 3?

In [24]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

## 7) Different ways to deal with NAâ€™s in dataframe
SSC percentage of roll number is missing. Can you replace the missing value using the mean of SSC percentage?

In [25]:
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))  
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     h
2        3      F       A  ...        13        Not placed                     d
4        5      M       A  ...        17        Not placed                     h
5        6      M       A  ...         6        Not placed                     h

[5 rows x 9 columns]

## 8) Groupby operations on dataframe
What is the average B.Tech percentage of Male and Female students? Use Groupby.

In [26]:
grouped=df.groupby("Gender")
grouped["B.Tech_percentage"].agg(np.mean)

Gender
F    71.292400
M    57.343881
Name: B.Tech_percentage, dtype: float64

## 9) Merging the dataframes

There is another file having information about student's place information (Urban/rural). Can you merge the dataframe with the student's data?

In [27]:
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [28]:
df=pd.merge(df,df2,on='Roll No')
df.head()

   Roll No Gender Section  ...  placement status  hostler/days scholar  Urban/Rural
0        1      M       A  ...        Not placed                     d        Urban
1        2      F       A  ...            Placed                     h        Rural
2        3      F       A  ...        Not placed                     d        Urban
3        5      M       A  ...        Not placed                     h        Urban
4        6      M       A  ...        Not placed                     h        Rural

[5 rows x 10 columns]